Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/tc.h
/**
 * \brief Header file for SAME/SAME70 TC
 *
 * Copyright (c) 2017-2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-06-05T16:39:35Z */
#ifndef SAME_SAME70_TC_MODULE_H
#define SAME_SAME70_TC_MODULE_H

/** \addtogroup SAME_SAME70 Timer Counter
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SAME70_TC                                    */
/* ========================================================================== */

/* -------- TC_CCR : (TC Offset: 0x00) ( /W 32) Channel Control Register (channel = 0) -------- */
#define TC_CCR_CLKEN_Pos                      (0U)                                           /**< (TC_CCR) Counter Clock Enable Command Position */
#define TC_CCR_CLKEN_Msk                      (0x1U << TC_CCR_CLKEN_Pos)                     /**< (TC_CCR) Counter Clock Enable Command Mask */
#define TC_CCR_CLKEN(value)                   (TC_CCR_CLKEN_Msk & ((value) << TC_CCR_CLKEN_Pos))
#define TC_CCR_CLKDIS_Pos                     (1U)                                           /**< (TC_CCR) Counter Clock Disable Command Position */
#define TC_CCR_CLKDIS_Msk                     (0x1U << TC_CCR_CLKDIS_Pos)                    /**< (TC_CCR) Counter Clock Disable Command Mask */
#define TC_CCR_CLKDIS(value)                  (TC_CCR_CLKDIS_Msk & ((value) << TC_CCR_CLKDIS_Pos))
#define TC_CCR_SWTRG_Pos                      (2U)                                           /**< (TC_CCR) Software Trigger Command Position */
#define TC_CCR_SWTRG_Msk                      (0x1U << TC_CCR_SWTRG_Pos)                     /**< (TC_CCR) Software Trigger Command Mask */
#define TC_CCR_SWTRG(value)                   (TC_CCR_SWTRG_Msk & ((value) << TC_CCR_SWTRG_Pos))
#define TC_CCR_Msk                            (0x00000007UL)                                 /**< (TC_CCR) Register Mask  */

/* -------- TC_CMR : (TC Offset: 0x04) (R/W 32) Channel Mode Register (channel = 0) -------- */
#define TC_CMR_TCCLKS_Pos                     (0U)                                           /**< (TC_CMR) Clock Selection Position */
#define TC_CMR_TCCLKS_Msk                     (0x7U << TC_CMR_TCCLKS_Pos)                    /**< (TC_CMR) Clock Selection Mask */
#define TC_CMR_TCCLKS(value)                  (TC_CMR_TCCLKS_Msk & ((value) << TC_CMR_TCCLKS_Pos))
#define   TC_CMR_TCCLKS_TIMER_CLOCK1_Val      (0U)                                           /**< (TC_CMR) Clock selected: internal PCK6 clock signal (from PMC)  */
#define   TC_CMR_TCCLKS_TIMER_CLOCK2_Val      (1U)                                           /**< (TC_CMR) Clock selected: internal MCK/8 clock signal (from PMC)  */
#define   TC_CMR_TCCLKS_TIMER_CLOCK3_Val      (2U)                                           /**< (TC_CMR) Clock selected: internal MCK/32 clock signal (from PMC)  */
#define   TC_CMR_TCCLKS_TIMER_CLOCK4_Val      (3U)                                           /**< (TC_CMR) Clock selected: internal MCK/128 clock signal (from PMC)  */
#define   TC_CMR_TCCLKS_TIMER_CLOCK5_Val      (4U)                                           /**< (TC_CMR) Clock selected: internal SLCK clock signal (from PMC)  */
#define   TC_CMR_TCCLKS_XC0_Val               (5U)                                           /**< (TC_CMR) Clock selected: XC0  */
#define   TC_CMR_TCCLKS_XC1_Val               (6U)                                           /**< (TC_CMR) Clock selected: XC1  */
#define   TC_CMR_TCCLKS_XC2_Val               (7U)                                           /**< (TC_CMR) Clock selected: XC2  */
#define TC_CMR_TCCLKS_TIMER_CLOCK1            (TC_CMR_TCCLKS_TIMER_CLOCK1_Val << TC_CMR_TCCLKS_Pos) /**< (TC_CMR) Clock selected: internal PCK6 clock signal (from PMC) Position  */
#define TC_CMR_TCCLKS_TIMER_CLOCK2            (TC_CMR_TCCLKS_TIMER_CLOCK2_Val << TC_CMR_TCCLKS_Pos) /**< (TC_CMR) Clock selected: internal MCK/8 clock signal (from PMC) Position  */
#define TC_CMR_TCCLKS_TIMER_CLOCK3            (TC_CMR_TCCLKS_TIMER_CLOCK3_Val << TC_CMR_TCCLKS_Pos) /**< (TC_CMR) Clock selected: internal MCK/32 clock signal (from PMC) Position  */
#define TC_CMR_TCCLKS_TIMER_CLOCK4            (TC_CMR_TCCLKS_TIMER_CLOCK4_Val << TC_CMR_TCCLKS_Pos) /**< (TC_CMR) Clock selected: internal MCK/128 clock signal (from PMC) Position  */
#define TC_CMR_TCCLKS_TIMER_CLOCK5            (TC_CMR_TCCLKS_TIMER_CLOCK5_Val << TC_CMR_TCCLKS_Pos) /**< (TC_CMR) Clock selected: internal SLCK clock signal (from PMC) Position  */
#define TC_CMR_TCCLKS_XC0                     (TC_CMR_TCCLKS_XC0_Val << TC_CMR_TCCLKS_Pos)   /**< (TC_CMR) Clock selected: XC0 Position  */
#define TC_CMR_TCCLKS_XC1                     (TC_CMR_TCCLKS_XC1_Val << TC_CMR_TCCLKS_Pos)   /**< (TC_CMR) Clock selected: XC1 Position  */
#define TC_CMR_TCCLKS_XC2                     (TC_CMR_TCCLKS_XC2_Val << TC_CMR_TCCLKS_Pos)   /**< (TC_CMR) Clock selected: XC2 Position  */
#define TC_CMR_CLKI_Pos                       (3U)                                           /**< (TC_CMR) Clock Invert Position */
#define TC_CMR_CLKI_Msk                       (0x1U << TC_CMR_CLKI_Pos)                      /**< (TC_CMR) Clock Invert Mask */
#define TC_CMR_CLKI(value)                    (TC_CMR_CLKI_Msk & ((value) << TC_CMR_CLKI_Pos))
#define TC_CMR_BURST_Pos                      (4U)                                           /**< (TC_CMR) Burst Signal Selection Position */
#define TC_CMR_BURST_Msk                      (0x3U << TC_CMR_BURST_Pos)                     /**< (TC_CMR) Burst Signal Selection Mask */
#define TC_CMR_BURST(value)                   (TC_CMR_BURST_Msk & ((value) << TC_CMR_BURST_Pos))
#define   TC_CMR_BURST_NONE_Val               (0U)                                           /**< (TC_CMR) The clock is not gated by an external signal.  */
#define   TC_CMR_BURST_XC0_Val                (1U)                                           /**< (TC_CMR) XC0 is ANDed with the selected clock.  */
#define   TC_CMR_BURST_XC1_Val                (2U)                                           /**< (TC_CMR) XC1 is ANDed with the selected clock.  */
#define   TC_CMR_BURST_XC2_Val                (3U)                                           /**< (TC_CMR) XC2 is ANDed with the selected clock.  */
#define TC_CMR_BURST_NONE                     (TC_CMR_BURST_NONE_Val << TC_CMR_BURST_Pos)    /**< (TC_CMR) The clock is not gated by an external signal. Position  */
#define TC_CMR_BURST_XC0                      (TC_CMR_BURST_XC0_Val << TC_CMR_BURST_Pos)     /**< (TC_CMR) XC0 is ANDed with the selected clock. Position  */
#define TC_CMR_BURST_XC1                      (TC_CMR_BURST_XC1_Val << TC_CMR_BURST_Pos)     /**< (TC_CMR) XC1 is ANDed with the selected clock. Position  */
#define TC_CMR_BURST_XC2                      (TC_CMR_BURST_XC2_Val << TC_CMR_BURST_Pos)     /**< (TC_CMR) XC2 is ANDed with the selected clock. Position  */
#define TC_CMR_LDBSTOP_Pos                    (6U)                                           /**< (TC_CMR) Counter Clock Stopped with RB Loading Position */
#define TC_CMR_LDBSTOP_Msk                    (0x1U << TC_CMR_LDBSTOP_Pos)                   /**< (TC_CMR) Counter Clock Stopped with RB Loading Mask */
#define TC_CMR_LDBSTOP(value)                 (TC_CMR_LDBSTOP_Msk & ((value) << TC_CMR_LDBSTOP_Pos))
#define TC_CMR_CPCSTOP_Pos                    (6U)                                           /**< (TC_CMR) Counter Clock Stopped with RC Compare Position */
#define TC_CMR_CPCSTOP_Msk                    (0x1U << TC_CMR_CPCSTOP_Pos)                   /**< (TC_CMR) Counter Clock Stopped with RC Compare Mask */
#define TC_CMR_CPCSTOP(value)                 (TC_CMR_CPCSTOP_Msk & ((value) << TC_CMR_CPCSTOP_Pos))
#define TC_CMR_LDBDIS_Pos                     (7U)                                           /**< (TC_CMR) Counter Clock Disable with RB Loading Position */
#define TC_CMR_LDBDIS_Msk                     (0x1U << TC_CMR_LDBDIS_Pos)                    /**< (TC_CMR) Counter Clock Disable with RB Loading Mask */
#define TC_CMR_LDBDIS(value)                  (TC_CMR_LDBDIS_Msk & ((value) << TC_CMR_LDBDIS_Pos))
#define TC_CMR_CPCDIS_Pos                     (7U)                                           /**< (TC_CMR) Counter Clock Disable with RC Loading Position */
#define TC_CMR_CPCDIS_Msk                     (0x1U << TC_CMR_CPCDIS_Pos)                    /**< (TC_CMR) Counter Clock Disable with RC Loading Mask */
#define TC_CMR_CPCDIS(value)                  (TC_CMR_CPCDIS_Msk & ((value) << TC_CMR_CPCDIS_Pos))
#define TC_CMR_ETRGEDG_Pos                    (8U)                                           /**< (TC_CMR) External Trigger Edge Selection Position */
#define TC_CMR_ETRGEDG_Msk                    (0x3U << TC_CMR_ETRGEDG_Pos)                   /**< (TC_CMR) External Trigger Edge Selection Mask */
#define TC_CMR_ETRGEDG(value)                 (TC_CMR_ETRGEDG_Msk & ((value) << TC_CMR_ETRGEDG_Pos))
#define   TC_CMR_ETRGEDG_NONE_Val             (0U)                                           /**< (TC_CMR) The clock is not gated by an external signal.  */
#define   TC_CMR_ETRGEDG_RISING_Val           (1U)                                           /**< (TC_CMR) Rising edge  */
#define   TC_CMR_ETRGEDG_FALLING_Val          (2U)                                           /**< (TC_CMR) Falling edge  */
#define   TC_CMR_ETRGEDG_EDGE_Val             (3U)                                           /**< (TC_CMR) Each edge  */
#define TC_CMR_ETRGEDG_NONE                   (TC_CMR_ETRGEDG_NONE_Val << TC_CMR_ETRGEDG_Pos) /**< (TC_CMR) The clock is not gated by an external signal. Position  */
#define TC_CMR_ETRGEDG_RISING                 (TC_CMR_ETRGEDG_RISING_Val << TC_CMR_ETRGEDG_Pos) /**< (TC_CMR) Rising edge Position  */
#define TC_CMR_ETRGEDG_FALLING                (TC_CMR_ETRGEDG_FALLING_Val << TC_CMR_ETRGEDG_Pos) /**< (TC_CMR) Falling edge Position  */
#define TC_CMR_ETRGEDG_EDGE                   (TC_CMR_ETRGEDG_EDGE_Val << TC_CMR_ETRGEDG_Pos) /**< (TC_CMR) Each edge Position  */
#define TC_CMR_EEVTEDG_Pos                    (8U)                                           /**< (TC_CMR) External Event Edge Selection Position */
#define TC_CMR_EEVTEDG_Msk                    (0x3U << TC_CMR_EEVTEDG_Pos)                   /**< (TC_CMR) External Event Edge Selection Mask */
#define TC_CMR_EEVTEDG(value)                 (TC_CMR_EEVTEDG_Msk & ((value) << TC_CMR_EEVTEDG_Pos))
#define   TC_CMR_EEVTEDG_NONE_Val             (0U)                                           /**< (TC_CMR) None  */
#define   TC_CMR_EEVTEDG_RISING_Val           (1U)                                           /**< (TC_CMR) Rising edge  */
#define   TC_CMR_EEVTEDG_FALLING_Val          (2U)                                           /**< (TC_CMR) Falling edge  */
#define   TC_CMR_EEVTEDG_EDGE_Val             (3U)                                           /**< (TC_CMR) Each edges  */
#define TC_CMR_EEVTEDG_NONE                   (TC_CMR_EEVTEDG_NONE_Val << TC_CMR_EEVTEDG_Pos) /**< (TC_CMR) None Position  */
#define TC_CMR_EEVTEDG_RISING                 (TC_CMR_EEVTEDG_RISING_Val << TC_CMR_EEVTEDG_Pos) /**< (TC_CMR) Rising edge Position  */
#define TC_CMR_EEVTEDG_FALLING                (TC_CMR_EEVTEDG_FALLING_Val << TC_CMR_EEVTEDG_Pos) /**< (TC_CMR) Falling edge Position  */
#define TC_CMR_EEVTEDG_EDGE                   (TC_CMR_EEVTEDG_EDGE_Val << TC_CMR_EEVTEDG_Pos) /**< (TC_CMR) Each edges Position  */
#define TC_CMR_ABETRG_Pos                     (10U)                                          /**< (TC_CMR) TIOAx or TIOBx External Trigger Selection Position */
#define TC_CMR_ABETRG_Msk                     (0x1U << TC_CMR_ABETRG_Pos)                    /**< (TC_CMR) TIOAx or TIOBx External Trigger Selection Mask */
#define TC_CMR_ABETRG(value)                  (TC_CMR_ABETRG_Msk & ((value) << TC_CMR_ABETRG_Pos))
#define TC_CMR_EEVT_Pos                       (10U)                                          /**< (TC_CMR) External Event Selection Position */
#define TC_CMR_EEVT_Msk                       (0x3U << TC_CMR_EEVT_Pos)                      /**< (TC_CMR) External Event Selection Mask */
#define TC_CMR_EEVT(value)                    (TC_CMR_EEVT_Msk & ((value) << TC_CMR_EEVT_Pos))
#define   TC_CMR_EEVT_TIOB_Val                (0U)                                           /**< (TC_CMR) TIOB  */
#define   TC_CMR_EEVT_XC0_Val                 (1U)                                           /**< (TC_CMR) XC0  */
#define   TC_CMR_EEVT_XC1_Val                 (2U)                                           /**< (TC_CMR) XC1  */
#define   TC_CMR_EEVT_XC2_Val                 (3U)                                           /**< (TC_CMR) XC2  */
#define TC_CMR_EEVT_TIOB                      (TC_CMR_EEVT_TIOB_Val << TC_CMR_EEVT_Pos)      /**< (TC_CMR) TIOB Position  */
#define TC_CMR_EEVT_XC0                       (TC_CMR_EEVT_XC0_Val << TC_CMR_EEVT_Pos)       /**< (TC_CMR) XC0 Position  */
#define TC_CMR_EEVT_XC1                       (TC_CMR_EEVT_XC1_Val << TC_CMR_EEVT_Pos)       /**< (TC_CMR) XC1 Position  */
#define TC_CMR_EEVT_XC2                       (TC_CMR_EEVT_XC2_Val << TC_CMR_EEVT_Pos)       /**< (TC_CMR) XC2 Position  */
#define TC_CMR_ENETRG_Pos                     (12U)                                          /**< (TC_CMR) External Event Trigger Enable Position */
#define TC_CMR_ENETRG_Msk                     (0x1U << TC_CMR_ENETRG_Pos)                    /**< (TC_CMR) External Event Trigger Enable Mask */
#define TC_CMR_ENETRG(value)                  (TC_CMR_ENETRG_Msk & ((value) << TC_CMR_ENETRG_Pos))
#define TC_CMR_WAVSEL_Pos                     (13U)                                          /**< (TC_CMR) Waveform Selection Position */
#define TC_CMR_WAVSEL_Msk                     (0x3U << TC_CMR_WAVSEL_Pos)                    /**< (TC_CMR) Waveform Selection Mask */
#define TC_CMR_WAVSEL(value)                  (TC_CMR_WAVSEL_Msk & ((value) << TC_CMR_WAVSEL_Pos))
#define   TC_CMR_WAVSEL_UP_Val                (0U)                                           /**< (TC_CMR) UP mode without automatic trigger on RC Compare  */
#define   TC_CMR_WAVSEL_UPDOWN_Val            (1U)                                           /**< (TC_CMR) UPDOWN mode without automatic trigger on RC Compare  */
#define   TC_CMR_WAVSEL_UP_RC_Val             (2U)                                           /**< (TC_CMR) UP mode with automatic trigger on RC Compare  */
#define   TC_CMR_WAVSEL_UPDOWN_RC_Val         (3U)                                           /**< (TC_CMR) UPDOWN mode with automatic trigger on RC Compare  */
#define TC_CMR_WAVSEL_UP                      (TC_CMR_WAVSEL_UP_Val << TC_CMR_WAVSEL_Pos)    /**< (TC_CMR) UP mode without automatic trigger on RC Compare Position  */
#define TC_CMR_WAVSEL_UPDOWN                  (TC_CMR_WAVSEL_UPDOWN_Val << TC_CMR_WAVSEL_Pos) /**< (TC_CMR) UPDOWN mode without automatic trigger on RC Compare Position  */
#define TC_CMR_WAVSEL_UP_RC                   (TC_CMR_WAVSEL_UP_RC_Val << TC_CMR_WAVSEL_Pos) /**< (TC_CMR) UP mode with automatic trigger on RC Compare Position  */
#define TC_CMR_WAVSEL_UPDOWN_RC               (TC_CMR_WAVSEL_UPDOWN_RC_Val << TC_CMR_WAVSEL_Pos) /**< (TC_CMR) UPDOWN mode with automatic trigger on RC Compare Position  */
#define TC_CMR_CPCTRG_Pos                     (14U)                                          /**< (TC_CMR) RC Compare Trigger Enable Position */
#define TC_CMR_CPCTRG_Msk                     (0x1U << TC_CMR_CPCTRG_Pos)                    /**< (TC_CMR) RC Compare Trigger Enable Mask */
#define TC_CMR_CPCTRG(value)                  (TC_CMR_CPCTRG_Msk & ((value) << TC_CMR_CPCTRG_Pos))
#define TC_CMR_WAVE_Pos                       (15U)                                          /**< (TC_CMR) Waveform Mode Position */
#define TC_CMR_WAVE_Msk                       (0x1U << TC_CMR_WAVE_Pos)                      /**< (TC_CMR) Waveform Mode Mask */
#define TC_CMR_WAVE(value)                    (TC_CMR_WAVE_Msk & ((value) << TC_CMR_WAVE_Pos))
#define TC_CMR_LDRA_Pos                       (16U)                                          /**< (TC_CMR) RA Loading Edge Selection Position */
#define TC_CMR_LDRA_Msk                       (0x3U << TC_CMR_LDRA_Pos)                      /**< (TC_CMR) RA Loading Edge Selection Mask */
#define TC_CMR_LDRA(value)                    (TC_CMR_LDRA_Msk & ((value) << TC_CMR_LDRA_Pos))
#define   TC_CMR_LDRA_NONE_Val                (0U)                                           /**< (TC_CMR) None  */
#define   TC_CMR_LDRA_RISING_Val              (1U)                                           /**< (TC_CMR) Rising edge of TIOAx  */
#define   TC_CMR_LDRA_FALLING_Val             (2U)                                           /**< (TC_CMR) Falling edge of TIOAx  */
#define   TC_CMR_LDRA_EDGE_Val                (3U)                                           /**< (TC_CMR) Each edge of TIOAx  */
#define TC_CMR_LDRA_NONE                      (TC_CMR_LDRA_NONE_Val << TC_CMR_LDRA_Pos)      /**< (TC_CMR) None Position  */
#define TC_CMR_LDRA_RISING                    (TC_CMR_LDRA_RISING_Val << TC_CMR_LDRA_Pos)    /**< (TC_CMR) Rising edge of TIOAx Position  */
#define TC_CMR_LDRA_FALLING                   (TC_CMR_LDRA_FALLING_Val << TC_CMR_LDRA_Pos)   /**< (TC_CMR) Falling edge of TIOAx Position  */
#define TC_CMR_LDRA_EDGE                      (TC_CMR_LDRA_EDGE_Val << TC_CMR_LDRA_Pos)      /**< (TC_CMR) Each edge of TIOAx Position  */
#define TC_CMR_ACPA_Pos                       (16U)                                          /**< (TC_CMR) RA Compare Effect on TIOAx Position */
#define TC_CMR_ACPA_Msk                       (0x3U << TC_CMR_ACPA_Pos)                      /**< (TC_CMR) RA Compare Effect on TIOAx Mask */
#define TC_CMR_ACPA(value)                    (TC_CMR_ACPA_Msk & ((value) << TC_CMR_ACPA_Pos))
#define   TC_CMR_ACPA_NONE_Val                (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_ACPA_SET_Val                 (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_ACPA_CLEAR_Val               (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_ACPA_TOGGLE_Val              (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_ACPA_NONE                      (TC_CMR_ACPA_NONE_Val << TC_CMR_ACPA_Pos)      /**< (TC_CMR) NONE Position  */
#define TC_CMR_ACPA_SET                       (TC_CMR_ACPA_SET_Val << TC_CMR_ACPA_Pos)       /**< (TC_CMR) SET Position  */
#define TC_CMR_ACPA_CLEAR                     (TC_CMR_ACPA_CLEAR_Val << TC_CMR_ACPA_Pos)     /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_ACPA_TOGGLE                    (TC_CMR_ACPA_TOGGLE_Val << TC_CMR_ACPA_Pos)    /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_LDRB_Pos                       (18U)                                          /**< (TC_CMR) RB Loading Edge Selection Position */
#define TC_CMR_LDRB_Msk                       (0x3U << TC_CMR_LDRB_Pos)                      /**< (TC_CMR) RB Loading Edge Selection Mask */
#define TC_CMR_LDRB(value)                    (TC_CMR_LDRB_Msk & ((value) << TC_CMR_LDRB_Pos))
#define   TC_CMR_LDRB_NONE_Val                (0U)                                           /**< (TC_CMR) None  */
#define   TC_CMR_LDRB_RISING_Val              (1U)                                           /**< (TC_CMR) Rising edge of TIOAx  */
#define   TC_CMR_LDRB_FALLING_Val             (2U)                                           /**< (TC_CMR) Falling edge of TIOAx  */
#define   TC_CMR_LDRB_EDGE_Val                (3U)                                           /**< (TC_CMR) Each edge of TIOAx  */
#define TC_CMR_LDRB_NONE                      (TC_CMR_LDRB_NONE_Val << TC_CMR_LDRB_Pos)      /**< (TC_CMR) None Position  */
#define TC_CMR_LDRB_RISING                    (TC_CMR_LDRB_RISING_Val << TC_CMR_LDRB_Pos)    /**< (TC_CMR) Rising edge of TIOAx Position  */
#define TC_CMR_LDRB_FALLING                   (TC_CMR_LDRB_FALLING_Val << TC_CMR_LDRB_Pos)   /**< (TC_CMR) Falling edge of TIOAx Position  */
#define TC_CMR_LDRB_EDGE                      (TC_CMR_LDRB_EDGE_Val << TC_CMR_LDRB_Pos)      /**< (TC_CMR) Each edge of TIOAx Position  */
#define TC_CMR_ACPC_Pos                       (18U)                                          /**< (TC_CMR) RC Compare Effect on TIOAx Position */
#define TC_CMR_ACPC_Msk                       (0x3U << TC_CMR_ACPC_Pos)                      /**< (TC_CMR) RC Compare Effect on TIOAx Mask */
#define TC_CMR_ACPC(value)                    (TC_CMR_ACPC_Msk & ((value) << TC_CMR_ACPC_Pos))
#define   TC_CMR_ACPC_NONE_Val                (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_ACPC_SET_Val                 (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_ACPC_CLEAR_Val               (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_ACPC_TOGGLE_Val              (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_ACPC_NONE                      (TC_CMR_ACPC_NONE_Val << TC_CMR_ACPC_Pos)      /**< (TC_CMR) NONE Position  */
#define TC_CMR_ACPC_SET                       (TC_CMR_ACPC_SET_Val << TC_CMR_ACPC_Pos)       /**< (TC_CMR) SET Position  */
#define TC_CMR_ACPC_CLEAR                     (TC_CMR_ACPC_CLEAR_Val << TC_CMR_ACPC_Pos)     /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_ACPC_TOGGLE                    (TC_CMR_ACPC_TOGGLE_Val << TC_CMR_ACPC_Pos)    /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_SBSMPLR_Pos                    (20U)                                          /**< (TC_CMR) Loading Edge Subsampling Ratio Position */
#define TC_CMR_SBSMPLR_Msk                    (0x7U << TC_CMR_SBSMPLR_Pos)                   /**< (TC_CMR) Loading Edge Subsampling Ratio Mask */
#define TC_CMR_SBSMPLR(value)                 (TC_CMR_SBSMPLR_Msk & ((value) << TC_CMR_SBSMPLR_Pos))
#define   TC_CMR_SBSMPLR_ONE_Val              (0U)                                           /**< (TC_CMR) Load a Capture Register each selected edge  */
#define   TC_CMR_SBSMPLR_HALF_Val             (1U)                                           /**< (TC_CMR) Load a Capture Register every 2 selected edges  */
#define   TC_CMR_SBSMPLR_FOURTH_Val           (2U)                                           /**< (TC_CMR) Load a Capture Register every 4 selected edges  */
#define   TC_CMR_SBSMPLR_EIGHTH_Val           (3U)                                           /**< (TC_CMR) Load a Capture Register every 8 selected edges  */
#define   TC_CMR_SBSMPLR_SIXTEENTH_Val        (4U)                                           /**< (TC_CMR) Load a Capture Register every 16 selected edges  */
#define TC_CMR_SBSMPLR_ONE                    (TC_CMR_SBSMPLR_ONE_Val << TC_CMR_SBSMPLR_Pos) /**< (TC_CMR) Load a Capture Register each selected edge Position  */
#define TC_CMR_SBSMPLR_HALF                   (TC_CMR_SBSMPLR_HALF_Val << TC_CMR_SBSMPLR_Pos) /**< (TC_CMR) Load a Capture Register every 2 selected edges Position  */
#define TC_CMR_SBSMPLR_FOURTH                 (TC_CMR_SBSMPLR_FOURTH_Val << TC_CMR_SBSMPLR_Pos) /**< (TC_CMR) Load a Capture Register every 4 selected edges Position  */
