Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/tc.h
#define TC_CMR_SBSMPLR_EIGHTH                 (TC_CMR_SBSMPLR_EIGHTH_Val << TC_CMR_SBSMPLR_Pos) /**< (TC_CMR) Load a Capture Register every 8 selected edges Position  */
#define TC_CMR_SBSMPLR_SIXTEENTH              (TC_CMR_SBSMPLR_SIXTEENTH_Val << TC_CMR_SBSMPLR_Pos) /**< (TC_CMR) Load a Capture Register every 16 selected edges Position  */
#define TC_CMR_AEEVT_Pos                      (20U)                                          /**< (TC_CMR) External Event Effect on TIOAx Position */
#define TC_CMR_AEEVT_Msk                      (0x3U << TC_CMR_AEEVT_Pos)                     /**< (TC_CMR) External Event Effect on TIOAx Mask */
#define TC_CMR_AEEVT(value)                   (TC_CMR_AEEVT_Msk & ((value) << TC_CMR_AEEVT_Pos))
#define   TC_CMR_AEEVT_NONE_Val               (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_AEEVT_SET_Val                (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_AEEVT_CLEAR_Val              (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_AEEVT_TOGGLE_Val             (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_AEEVT_NONE                     (TC_CMR_AEEVT_NONE_Val << TC_CMR_AEEVT_Pos)    /**< (TC_CMR) NONE Position  */
#define TC_CMR_AEEVT_SET                      (TC_CMR_AEEVT_SET_Val << TC_CMR_AEEVT_Pos)     /**< (TC_CMR) SET Position  */
#define TC_CMR_AEEVT_CLEAR                    (TC_CMR_AEEVT_CLEAR_Val << TC_CMR_AEEVT_Pos)   /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_AEEVT_TOGGLE                   (TC_CMR_AEEVT_TOGGLE_Val << TC_CMR_AEEVT_Pos)  /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_ASWTRG_Pos                     (22U)                                          /**< (TC_CMR) Software Trigger Effect on TIOAx Position */
#define TC_CMR_ASWTRG_Msk                     (0x3U << TC_CMR_ASWTRG_Pos)                    /**< (TC_CMR) Software Trigger Effect on TIOAx Mask */
#define TC_CMR_ASWTRG(value)                  (TC_CMR_ASWTRG_Msk & ((value) << TC_CMR_ASWTRG_Pos))
#define   TC_CMR_ASWTRG_NONE_Val              (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_ASWTRG_SET_Val               (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_ASWTRG_CLEAR_Val             (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_ASWTRG_TOGGLE_Val            (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_ASWTRG_NONE                    (TC_CMR_ASWTRG_NONE_Val << TC_CMR_ASWTRG_Pos)  /**< (TC_CMR) NONE Position  */
#define TC_CMR_ASWTRG_SET                     (TC_CMR_ASWTRG_SET_Val << TC_CMR_ASWTRG_Pos)   /**< (TC_CMR) SET Position  */
#define TC_CMR_ASWTRG_CLEAR                   (TC_CMR_ASWTRG_CLEAR_Val << TC_CMR_ASWTRG_Pos) /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_ASWTRG_TOGGLE                  (TC_CMR_ASWTRG_TOGGLE_Val << TC_CMR_ASWTRG_Pos) /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BCPB_Pos                       (24U)                                          /**< (TC_CMR) RB Compare Effect on TIOBx Position */
#define TC_CMR_BCPB_Msk                       (0x3U << TC_CMR_BCPB_Pos)                      /**< (TC_CMR) RB Compare Effect on TIOBx Mask */
#define TC_CMR_BCPB(value)                    (TC_CMR_BCPB_Msk & ((value) << TC_CMR_BCPB_Pos))
#define   TC_CMR_BCPB_NONE_Val                (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_BCPB_SET_Val                 (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_BCPB_CLEAR_Val               (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BCPB_TOGGLE_Val              (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BCPB_NONE                      (TC_CMR_BCPB_NONE_Val << TC_CMR_BCPB_Pos)      /**< (TC_CMR) NONE Position  */
#define TC_CMR_BCPB_SET                       (TC_CMR_BCPB_SET_Val << TC_CMR_BCPB_Pos)       /**< (TC_CMR) SET Position  */
#define TC_CMR_BCPB_CLEAR                     (TC_CMR_BCPB_CLEAR_Val << TC_CMR_BCPB_Pos)     /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BCPB_TOGGLE                    (TC_CMR_BCPB_TOGGLE_Val << TC_CMR_BCPB_Pos)    /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BCPC_Pos                       (26U)                                          /**< (TC_CMR) RC Compare Effect on TIOBx Position */
#define TC_CMR_BCPC_Msk                       (0x3U << TC_CMR_BCPC_Pos)                      /**< (TC_CMR) RC Compare Effect on TIOBx Mask */
#define TC_CMR_BCPC(value)                    (TC_CMR_BCPC_Msk & ((value) << TC_CMR_BCPC_Pos))
#define   TC_CMR_BCPC_NONE_Val                (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_BCPC_SET_Val                 (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_BCPC_CLEAR_Val               (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BCPC_TOGGLE_Val              (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BCPC_NONE                      (TC_CMR_BCPC_NONE_Val << TC_CMR_BCPC_Pos)      /**< (TC_CMR) NONE Position  */
#define TC_CMR_BCPC_SET                       (TC_CMR_BCPC_SET_Val << TC_CMR_BCPC_Pos)       /**< (TC_CMR) SET Position  */
#define TC_CMR_BCPC_CLEAR                     (TC_CMR_BCPC_CLEAR_Val << TC_CMR_BCPC_Pos)     /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BCPC_TOGGLE                    (TC_CMR_BCPC_TOGGLE_Val << TC_CMR_BCPC_Pos)    /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BEEVT_Pos                      (28U)                                          /**< (TC_CMR) External Event Effect on TIOBx Position */
#define TC_CMR_BEEVT_Msk                      (0x3U << TC_CMR_BEEVT_Pos)                     /**< (TC_CMR) External Event Effect on TIOBx Mask */
#define TC_CMR_BEEVT(value)                   (TC_CMR_BEEVT_Msk & ((value) << TC_CMR_BEEVT_Pos))
#define   TC_CMR_BEEVT_NONE_Val               (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_BEEVT_SET_Val                (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_BEEVT_CLEAR_Val              (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BEEVT_TOGGLE_Val             (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BEEVT_NONE                     (TC_CMR_BEEVT_NONE_Val << TC_CMR_BEEVT_Pos)    /**< (TC_CMR) NONE Position  */
#define TC_CMR_BEEVT_SET                      (TC_CMR_BEEVT_SET_Val << TC_CMR_BEEVT_Pos)     /**< (TC_CMR) SET Position  */
#define TC_CMR_BEEVT_CLEAR                    (TC_CMR_BEEVT_CLEAR_Val << TC_CMR_BEEVT_Pos)   /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BEEVT_TOGGLE                   (TC_CMR_BEEVT_TOGGLE_Val << TC_CMR_BEEVT_Pos)  /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_BSWTRG_Pos                     (30U)                                          /**< (TC_CMR) Software Trigger Effect on TIOBx Position */
#define TC_CMR_BSWTRG_Msk                     (0x3U << TC_CMR_BSWTRG_Pos)                    /**< (TC_CMR) Software Trigger Effect on TIOBx Mask */
#define TC_CMR_BSWTRG(value)                  (TC_CMR_BSWTRG_Msk & ((value) << TC_CMR_BSWTRG_Pos))
#define   TC_CMR_BSWTRG_NONE_Val              (0U)                                           /**< (TC_CMR) NONE  */
#define   TC_CMR_BSWTRG_SET_Val               (1U)                                           /**< (TC_CMR) SET  */
#define   TC_CMR_BSWTRG_CLEAR_Val             (2U)                                           /**< (TC_CMR) CLEAR  */
#define   TC_CMR_BSWTRG_TOGGLE_Val            (3U)                                           /**< (TC_CMR) TOGGLE  */
#define TC_CMR_BSWTRG_NONE                    (TC_CMR_BSWTRG_NONE_Val << TC_CMR_BSWTRG_Pos)  /**< (TC_CMR) NONE Position  */
#define TC_CMR_BSWTRG_SET                     (TC_CMR_BSWTRG_SET_Val << TC_CMR_BSWTRG_Pos)   /**< (TC_CMR) SET Position  */
#define TC_CMR_BSWTRG_CLEAR                   (TC_CMR_BSWTRG_CLEAR_Val << TC_CMR_BSWTRG_Pos) /**< (TC_CMR) CLEAR Position  */
#define TC_CMR_BSWTRG_TOGGLE                  (TC_CMR_BSWTRG_TOGGLE_Val << TC_CMR_BSWTRG_Pos) /**< (TC_CMR) TOGGLE Position  */
#define TC_CMR_Msk                            (0xFFFFFFFFUL)                                 /**< (TC_CMR) Register Mask  */

/* -------- TC_SMMR : (TC Offset: 0x08) (R/W 32) Stepper Motor Mode Register (channel = 0) -------- */
#define TC_SMMR_GCEN_Pos                      (0U)                                           /**< (TC_SMMR) Gray Count Enable Position */
#define TC_SMMR_GCEN_Msk                      (0x1U << TC_SMMR_GCEN_Pos)                     /**< (TC_SMMR) Gray Count Enable Mask */
#define TC_SMMR_GCEN(value)                   (TC_SMMR_GCEN_Msk & ((value) << TC_SMMR_GCEN_Pos))
#define TC_SMMR_DOWN_Pos                      (1U)                                           /**< (TC_SMMR) Down Count Position */
#define TC_SMMR_DOWN_Msk                      (0x1U << TC_SMMR_DOWN_Pos)                     /**< (TC_SMMR) Down Count Mask */
#define TC_SMMR_DOWN(value)                   (TC_SMMR_DOWN_Msk & ((value) << TC_SMMR_DOWN_Pos))
#define TC_SMMR_Msk                           (0x00000003UL)                                 /**< (TC_SMMR) Register Mask  */

/* -------- TC_RAB : (TC Offset: 0x0C) (R/  32) Register AB (channel = 0) -------- */
#define TC_RAB_RAB_Pos                        (0U)                                           /**< (TC_RAB) Register A or Register B Position */
#define TC_RAB_RAB_Msk                        (0xFFFFFFFFU << TC_RAB_RAB_Pos)                /**< (TC_RAB) Register A or Register B Mask */
#define TC_RAB_RAB(value)                     (TC_RAB_RAB_Msk & ((value) << TC_RAB_RAB_Pos))
#define TC_RAB_Msk                            (0xFFFFFFFFUL)                                 /**< (TC_RAB) Register Mask  */

/* -------- TC_CV : (TC Offset: 0x10) (R/  32) Counter Value (channel = 0) -------- */
#define TC_CV_CV_Pos                          (0U)                                           /**< (TC_CV) Counter Value Position */
#define TC_CV_CV_Msk                          (0xFFFFFFFFU << TC_CV_CV_Pos)                  /**< (TC_CV) Counter Value Mask */
#define TC_CV_CV(value)                       (TC_CV_CV_Msk & ((value) << TC_CV_CV_Pos))    
#define TC_CV_Msk                             (0xFFFFFFFFUL)                                 /**< (TC_CV) Register Mask  */

