Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/tc.h
/* -------- TC_IER : (TC Offset: 0x24) ( /W 32) Interrupt Enable Register (channel = 0) -------- */
#define TC_IER_COVFS_Pos                      (0U)                                           /**< (TC_IER) Counter Overflow Position */
#define TC_IER_COVFS_Msk                      (0x1U << TC_IER_COVFS_Pos)                     /**< (TC_IER) Counter Overflow Mask */
#define TC_IER_COVFS(value)                   (TC_IER_COVFS_Msk & ((value) << TC_IER_COVFS_Pos))
#define TC_IER_LOVRS_Pos                      (1U)                                           /**< (TC_IER) Load Overrun Position */
#define TC_IER_LOVRS_Msk                      (0x1U << TC_IER_LOVRS_Pos)                     /**< (TC_IER) Load Overrun Mask */
#define TC_IER_LOVRS(value)                   (TC_IER_LOVRS_Msk & ((value) << TC_IER_LOVRS_Pos))
#define TC_IER_CPAS_Pos                       (2U)                                           /**< (TC_IER) RA Compare Position */
#define TC_IER_CPAS_Msk                       (0x1U << TC_IER_CPAS_Pos)                      /**< (TC_IER) RA Compare Mask */
#define TC_IER_CPAS(value)                    (TC_IER_CPAS_Msk & ((value) << TC_IER_CPAS_Pos))
#define TC_IER_CPBS_Pos                       (3U)                                           /**< (TC_IER) RB Compare Position */
#define TC_IER_CPBS_Msk                       (0x1U << TC_IER_CPBS_Pos)                      /**< (TC_IER) RB Compare Mask */
#define TC_IER_CPBS(value)                    (TC_IER_CPBS_Msk & ((value) << TC_IER_CPBS_Pos))
#define TC_IER_CPCS_Pos                       (4U)                                           /**< (TC_IER) RC Compare Position */
#define TC_IER_CPCS_Msk                       (0x1U << TC_IER_CPCS_Pos)                      /**< (TC_IER) RC Compare Mask */
#define TC_IER_CPCS(value)                    (TC_IER_CPCS_Msk & ((value) << TC_IER_CPCS_Pos))
#define TC_IER_LDRAS_Pos                      (5U)                                           /**< (TC_IER) RA Loading Position */
#define TC_IER_LDRAS_Msk                      (0x1U << TC_IER_LDRAS_Pos)                     /**< (TC_IER) RA Loading Mask */
#define TC_IER_LDRAS(value)                   (TC_IER_LDRAS_Msk & ((value) << TC_IER_LDRAS_Pos))
#define TC_IER_LDRBS_Pos                      (6U)                                           /**< (TC_IER) RB Loading Position */
#define TC_IER_LDRBS_Msk                      (0x1U << TC_IER_LDRBS_Pos)                     /**< (TC_IER) RB Loading Mask */
#define TC_IER_LDRBS(value)                   (TC_IER_LDRBS_Msk & ((value) << TC_IER_LDRBS_Pos))
#define TC_IER_ETRGS_Pos                      (7U)                                           /**< (TC_IER) External Trigger Position */
#define TC_IER_ETRGS_Msk                      (0x1U << TC_IER_ETRGS_Pos)                     /**< (TC_IER) External Trigger Mask */
#define TC_IER_ETRGS(value)                   (TC_IER_ETRGS_Msk & ((value) << TC_IER_ETRGS_Pos))
#define TC_IER_Msk                            (0x000000FFUL)                                 /**< (TC_IER) Register Mask  */

/* -------- TC_IDR : (TC Offset: 0x28) ( /W 32) Interrupt Disable Register (channel = 0) -------- */
#define TC_IDR_COVFS_Pos                      (0U)                                           /**< (TC_IDR) Counter Overflow Position */
#define TC_IDR_COVFS_Msk                      (0x1U << TC_IDR_COVFS_Pos)                     /**< (TC_IDR) Counter Overflow Mask */
#define TC_IDR_COVFS(value)                   (TC_IDR_COVFS_Msk & ((value) << TC_IDR_COVFS_Pos))
#define TC_IDR_LOVRS_Pos                      (1U)                                           /**< (TC_IDR) Load Overrun Position */
#define TC_IDR_LOVRS_Msk                      (0x1U << TC_IDR_LOVRS_Pos)                     /**< (TC_IDR) Load Overrun Mask */
#define TC_IDR_LOVRS(value)                   (TC_IDR_LOVRS_Msk & ((value) << TC_IDR_LOVRS_Pos))
#define TC_IDR_CPAS_Pos                       (2U)                                           /**< (TC_IDR) RA Compare Position */
#define TC_IDR_CPAS_Msk                       (0x1U << TC_IDR_CPAS_Pos)                      /**< (TC_IDR) RA Compare Mask */
#define TC_IDR_CPAS(value)                    (TC_IDR_CPAS_Msk & ((value) << TC_IDR_CPAS_Pos))
#define TC_IDR_CPBS_Pos                       (3U)                                           /**< (TC_IDR) RB Compare Position */
#define TC_IDR_CPBS_Msk                       (0x1U << TC_IDR_CPBS_Pos)                      /**< (TC_IDR) RB Compare Mask */
#define TC_IDR_CPBS(value)                    (TC_IDR_CPBS_Msk & ((value) << TC_IDR_CPBS_Pos))
#define TC_IDR_CPCS_Pos                       (4U)                                           /**< (TC_IDR) RC Compare Position */
#define TC_IDR_CPCS_Msk                       (0x1U << TC_IDR_CPCS_Pos)                      /**< (TC_IDR) RC Compare Mask */
#define TC_IDR_CPCS(value)                    (TC_IDR_CPCS_Msk & ((value) << TC_IDR_CPCS_Pos))
#define TC_IDR_LDRAS_Pos                      (5U)                                           /**< (TC_IDR) RA Loading Position */
#define TC_IDR_LDRAS_Msk                      (0x1U << TC_IDR_LDRAS_Pos)                     /**< (TC_IDR) RA Loading Mask */
#define TC_IDR_LDRAS(value)                   (TC_IDR_LDRAS_Msk & ((value) << TC_IDR_LDRAS_Pos))
#define TC_IDR_LDRBS_Pos                      (6U)                                           /**< (TC_IDR) RB Loading Position */
#define TC_IDR_LDRBS_Msk                      (0x1U << TC_IDR_LDRBS_Pos)                     /**< (TC_IDR) RB Loading Mask */
#define TC_IDR_LDRBS(value)                   (TC_IDR_LDRBS_Msk & ((value) << TC_IDR_LDRBS_Pos))
#define TC_IDR_ETRGS_Pos                      (7U)                                           /**< (TC_IDR) External Trigger Position */
#define TC_IDR_ETRGS_Msk                      (0x1U << TC_IDR_ETRGS_Pos)                     /**< (TC_IDR) External Trigger Mask */
#define TC_IDR_ETRGS(value)                   (TC_IDR_ETRGS_Msk & ((value) << TC_IDR_ETRGS_Pos))
#define TC_IDR_Msk                            (0x000000FFUL)                                 /**< (TC_IDR) Register Mask  */

/* -------- TC_IMR : (TC Offset: 0x2C) (R/  32) Interrupt Mask Register (channel = 0) -------- */
#define TC_IMR_COVFS_Pos                      (0U)                                           /**< (TC_IMR) Counter Overflow Position */
#define TC_IMR_COVFS_Msk                      (0x1U << TC_IMR_COVFS_Pos)                     /**< (TC_IMR) Counter Overflow Mask */
#define TC_IMR_COVFS(value)                   (TC_IMR_COVFS_Msk & ((value) << TC_IMR_COVFS_Pos))
#define TC_IMR_LOVRS_Pos                      (1U)                                           /**< (TC_IMR) Load Overrun Position */
#define TC_IMR_LOVRS_Msk                      (0x1U << TC_IMR_LOVRS_Pos)                     /**< (TC_IMR) Load Overrun Mask */
#define TC_IMR_LOVRS(value)                   (TC_IMR_LOVRS_Msk & ((value) << TC_IMR_LOVRS_Pos))
#define TC_IMR_CPAS_Pos                       (2U)                                           /**< (TC_IMR) RA Compare Position */
#define TC_IMR_CPAS_Msk                       (0x1U << TC_IMR_CPAS_Pos)                      /**< (TC_IMR) RA Compare Mask */
#define TC_IMR_CPAS(value)                    (TC_IMR_CPAS_Msk & ((value) << TC_IMR_CPAS_Pos))
#define TC_IMR_CPBS_Pos                       (3U)                                           /**< (TC_IMR) RB Compare Position */
#define TC_IMR_CPBS_Msk                       (0x1U << TC_IMR_CPBS_Pos)                      /**< (TC_IMR) RB Compare Mask */
#define TC_IMR_CPBS(value)                    (TC_IMR_CPBS_Msk & ((value) << TC_IMR_CPBS_Pos))
#define TC_IMR_CPCS_Pos                       (4U)                                           /**< (TC_IMR) RC Compare Position */
#define TC_IMR_CPCS_Msk                       (0x1U << TC_IMR_CPCS_Pos)                      /**< (TC_IMR) RC Compare Mask */
#define TC_IMR_CPCS(value)                    (TC_IMR_CPCS_Msk & ((value) << TC_IMR_CPCS_Pos))
#define TC_IMR_LDRAS_Pos                      (5U)                                           /**< (TC_IMR) RA Loading Position */
#define TC_IMR_LDRAS_Msk                      (0x1U << TC_IMR_LDRAS_Pos)                     /**< (TC_IMR) RA Loading Mask */
#define TC_IMR_LDRAS(value)                   (TC_IMR_LDRAS_Msk & ((value) << TC_IMR_LDRAS_Pos))
#define TC_IMR_LDRBS_Pos                      (6U)                                           /**< (TC_IMR) RB Loading Position */
#define TC_IMR_LDRBS_Msk                      (0x1U << TC_IMR_LDRBS_Pos)                     /**< (TC_IMR) RB Loading Mask */
#define TC_IMR_LDRBS(value)                   (TC_IMR_LDRBS_Msk & ((value) << TC_IMR_LDRBS_Pos))
#define TC_IMR_ETRGS_Pos                      (7U)                                           /**< (TC_IMR) External Trigger Position */
#define TC_IMR_ETRGS_Msk                      (0x1U << TC_IMR_ETRGS_Pos)                     /**< (TC_IMR) External Trigger Mask */
#define TC_IMR_ETRGS(value)                   (TC_IMR_ETRGS_Msk & ((value) << TC_IMR_ETRGS_Pos))
#define TC_IMR_Msk                            (0x000000FFUL)                                 /**< (TC_IMR) Register Mask  */

/* -------- TC_EMR : (TC Offset: 0x30) (R/W 32) Extended Mode Register (channel = 0) -------- */
#define TC_EMR_TRIGSRCA_Pos                   (0U)                                           /**< (TC_EMR) Trigger Source for Input A Position */
#define TC_EMR_TRIGSRCA_Msk                   (0x3U << TC_EMR_TRIGSRCA_Pos)                  /**< (TC_EMR) Trigger Source for Input A Mask */
#define TC_EMR_TRIGSRCA(value)                (TC_EMR_TRIGSRCA_Msk & ((value) << TC_EMR_TRIGSRCA_Pos))
#define   TC_EMR_TRIGSRCA_EXTERNAL_TIOAx_Val  (0U)                                           /**< (TC_EMR) The trigger/capture input A is driven by external pin TIOAx  */
#define   TC_EMR_TRIGSRCA_PWMx_Val            (1U)                                           /**< (TC_EMR) The trigger/capture input A is driven internally by PWMx  */
#define TC_EMR_TRIGSRCA_EXTERNAL_TIOAx        (TC_EMR_TRIGSRCA_EXTERNAL_TIOAx_Val << TC_EMR_TRIGSRCA_Pos) /**< (TC_EMR) The trigger/capture input A is driven by external pin TIOAx Position  */
#define TC_EMR_TRIGSRCA_PWMx                  (TC_EMR_TRIGSRCA_PWMx_Val << TC_EMR_TRIGSRCA_Pos) /**< (TC_EMR) The trigger/capture input A is driven internally by PWMx Position  */
#define TC_EMR_TRIGSRCB_Pos                   (4U)                                           /**< (TC_EMR) Trigger Source for Input B Position */
#define TC_EMR_TRIGSRCB_Msk                   (0x3U << TC_EMR_TRIGSRCB_Pos)                  /**< (TC_EMR) Trigger Source for Input B Mask */
#define TC_EMR_TRIGSRCB(value)                (TC_EMR_TRIGSRCB_Msk & ((value) << TC_EMR_TRIGSRCB_Pos))
#define   TC_EMR_TRIGSRCB_EXTERNAL_TIOBx_Val  (0U)                                           /**< (TC_EMR) The trigger/capture input B is driven by external pin TIOBx  */
#define   TC_EMR_TRIGSRCB_PWMx_Val            (1U)                                           /**< (TC_EMR) For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC).  */
#define TC_EMR_TRIGSRCB_EXTERNAL_TIOBx        (TC_EMR_TRIGSRCB_EXTERNAL_TIOBx_Val << TC_EMR_TRIGSRCB_Pos) /**< (TC_EMR) The trigger/capture input B is driven by external pin TIOBx Position  */
#define TC_EMR_TRIGSRCB_PWMx                  (TC_EMR_TRIGSRCB_PWMx_Val << TC_EMR_TRIGSRCB_Pos) /**< (TC_EMR) For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC). Position  */
#define TC_EMR_NODIVCLK_Pos                   (8U)                                           /**< (TC_EMR) No Divided Clock Position */
#define TC_EMR_NODIVCLK_Msk                   (0x1U << TC_EMR_NODIVCLK_Pos)                  /**< (TC_EMR) No Divided Clock Mask */
#define TC_EMR_NODIVCLK(value)                (TC_EMR_NODIVCLK_Msk & ((value) << TC_EMR_NODIVCLK_Pos))
#define TC_EMR_Msk                            (0x00000133UL)                                 /**< (TC_EMR) Register Mask  */

