Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/tc.h
/* -------- TC_QIDR : (TC Offset: 0xCC) ( /W 32) QDEC Interrupt Disable Register -------- */
#define TC_QIDR_IDX_Pos                       (0U)                                           /**< (TC_QIDR) Index Position */
#define TC_QIDR_IDX_Msk                       (0x1U << TC_QIDR_IDX_Pos)                      /**< (TC_QIDR) Index Mask */
#define TC_QIDR_IDX(value)                    (TC_QIDR_IDX_Msk & ((value) << TC_QIDR_IDX_Pos))
#define TC_QIDR_DIRCHG_Pos                    (1U)                                           /**< (TC_QIDR) Direction Change Position */
#define TC_QIDR_DIRCHG_Msk                    (0x1U << TC_QIDR_DIRCHG_Pos)                   /**< (TC_QIDR) Direction Change Mask */
#define TC_QIDR_DIRCHG(value)                 (TC_QIDR_DIRCHG_Msk & ((value) << TC_QIDR_DIRCHG_Pos))
#define TC_QIDR_QERR_Pos                      (2U)                                           /**< (TC_QIDR) Quadrature Error Position */
#define TC_QIDR_QERR_Msk                      (0x1U << TC_QIDR_QERR_Pos)                     /**< (TC_QIDR) Quadrature Error Mask */
#define TC_QIDR_QERR(value)                   (TC_QIDR_QERR_Msk & ((value) << TC_QIDR_QERR_Pos))
#define TC_QIDR_Msk                           (0x00000007UL)                                 /**< (TC_QIDR) Register Mask  */

/* -------- TC_QIMR : (TC Offset: 0xD0) (R/  32) QDEC Interrupt Mask Register -------- */
#define TC_QIMR_IDX_Pos                       (0U)                                           /**< (TC_QIMR) Index Position */
#define TC_QIMR_IDX_Msk                       (0x1U << TC_QIMR_IDX_Pos)                      /**< (TC_QIMR) Index Mask */
#define TC_QIMR_IDX(value)                    (TC_QIMR_IDX_Msk & ((value) << TC_QIMR_IDX_Pos))
#define TC_QIMR_DIRCHG_Pos                    (1U)                                           /**< (TC_QIMR) Direction Change Position */
#define TC_QIMR_DIRCHG_Msk                    (0x1U << TC_QIMR_DIRCHG_Pos)                   /**< (TC_QIMR) Direction Change Mask */
#define TC_QIMR_DIRCHG(value)                 (TC_QIMR_DIRCHG_Msk & ((value) << TC_QIMR_DIRCHG_Pos))
#define TC_QIMR_QERR_Pos                      (2U)                                           /**< (TC_QIMR) Quadrature Error Position */
#define TC_QIMR_QERR_Msk                      (0x1U << TC_QIMR_QERR_Pos)                     /**< (TC_QIMR) Quadrature Error Mask */
#define TC_QIMR_QERR(value)                   (TC_QIMR_QERR_Msk & ((value) << TC_QIMR_QERR_Pos))
#define TC_QIMR_Msk                           (0x00000007UL)                                 /**< (TC_QIMR) Register Mask  */

/* -------- TC_QISR : (TC Offset: 0xD4) (R/  32) QDEC Interrupt Status Register -------- */
#define TC_QISR_IDX_Pos                       (0U)                                           /**< (TC_QISR) Index Position */
#define TC_QISR_IDX_Msk                       (0x1U << TC_QISR_IDX_Pos)                      /**< (TC_QISR) Index Mask */
#define TC_QISR_IDX(value)                    (TC_QISR_IDX_Msk & ((value) << TC_QISR_IDX_Pos))
#define TC_QISR_DIRCHG_Pos                    (1U)                                           /**< (TC_QISR) Direction Change Position */
#define TC_QISR_DIRCHG_Msk                    (0x1U << TC_QISR_DIRCHG_Pos)                   /**< (TC_QISR) Direction Change Mask */
#define TC_QISR_DIRCHG(value)                 (TC_QISR_DIRCHG_Msk & ((value) << TC_QISR_DIRCHG_Pos))
#define TC_QISR_QERR_Pos                      (2U)                                           /**< (TC_QISR) Quadrature Error Position */
#define TC_QISR_QERR_Msk                      (0x1U << TC_QISR_QERR_Pos)                     /**< (TC_QISR) Quadrature Error Mask */
#define TC_QISR_QERR(value)                   (TC_QISR_QERR_Msk & ((value) << TC_QISR_QERR_Pos))
#define TC_QISR_DIR_Pos                       (8U)                                           /**< (TC_QISR) Direction Position */
#define TC_QISR_DIR_Msk                       (0x1U << TC_QISR_DIR_Pos)                      /**< (TC_QISR) Direction Mask */
#define TC_QISR_DIR(value)                    (TC_QISR_DIR_Msk & ((value) << TC_QISR_DIR_Pos))
#define TC_QISR_Msk                           (0x00000107UL)                                 /**< (TC_QISR) Register Mask  */

/* -------- TC_FMR : (TC Offset: 0xD8) (R/W 32) Fault Mode Register -------- */
#define TC_FMR_ENCF0_Pos                      (0U)                                           /**< (TC_FMR) Enable Compare Fault Channel 0 Position */
#define TC_FMR_ENCF0_Msk                      (0x1U << TC_FMR_ENCF0_Pos)                     /**< (TC_FMR) Enable Compare Fault Channel 0 Mask */
#define TC_FMR_ENCF0(value)                   (TC_FMR_ENCF0_Msk & ((value) << TC_FMR_ENCF0_Pos))
#define TC_FMR_ENCF1_Pos                      (1U)                                           /**< (TC_FMR) Enable Compare Fault Channel 1 Position */
#define TC_FMR_ENCF1_Msk                      (0x1U << TC_FMR_ENCF1_Pos)                     /**< (TC_FMR) Enable Compare Fault Channel 1 Mask */
#define TC_FMR_ENCF1(value)                   (TC_FMR_ENCF1_Msk & ((value) << TC_FMR_ENCF1_Pos))
#define TC_FMR_Msk                            (0x00000003UL)                                 /**< (TC_FMR) Register Mask  */

/* -------- TC_WPMR : (TC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TC_WPMR_WPEN_Pos                      (0U)                                           /**< (TC_WPMR) Write Protection Enable Position */
#define TC_WPMR_WPEN_Msk                      (0x1U << TC_WPMR_WPEN_Pos)                     /**< (TC_WPMR) Write Protection Enable Mask */
#define TC_WPMR_WPEN(value)                   (TC_WPMR_WPEN_Msk & ((value) << TC_WPMR_WPEN_Pos))
#define TC_WPMR_WPKEY_Pos                     (8U)                                           /**< (TC_WPMR) Write Protection Key Position */
#define TC_WPMR_WPKEY_Msk                     (0xFFFFFFU << TC_WPMR_WPKEY_Pos)               /**< (TC_WPMR) Write Protection Key Mask */
#define TC_WPMR_WPKEY(value)                  (TC_WPMR_WPKEY_Msk & ((value) << TC_WPMR_WPKEY_Pos))
#define   TC_WPMR_WPKEY_PASSWD_Val            (5523789U)                                     /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define TC_WPMR_WPKEY_PASSWD                  (TC_WPMR_WPKEY_PASSWD_Val << TC_WPMR_WPKEY_Pos) /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define TC_WPMR_Msk                           (0xFFFFFF01UL)                                 /**< (TC_WPMR) Register Mask  */

