Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/tc.h
/** \brief TC register offsets definitions */
#define TC_CHANNEL_OFFSET              (0x00)         /**< (TC_CHANNEL) Channel Control Register (channel = 0) Offset */
  #define TC_CCR_OFFSET                  (0x00)         /**< (TC_CCR) Channel Control Register (channel = 0) Offset */
  #define TC_CMR_OFFSET                  (0x04)         /**< (TC_CMR) Channel Mode Register (channel = 0) Offset */
  #define TC_SMMR_OFFSET                 (0x08)         /**< (TC_SMMR) Stepper Motor Mode Register (channel = 0) Offset */
  #define TC_RAB_OFFSET                  (0x0C)         /**< (TC_RAB) Register AB (channel = 0) Offset */
  #define TC_CV_OFFSET                   (0x10)         /**< (TC_CV) Counter Value (channel = 0) Offset */
  #define TC_RA_OFFSET                   (0x14)         /**< (TC_RA) Register A (channel = 0) Offset */
  #define TC_RB_OFFSET                   (0x18)         /**< (TC_RB) Register B (channel = 0) Offset */
  #define TC_RC_OFFSET                   (0x1C)         /**< (TC_RC) Register C (channel = 0) Offset */
  #define TC_SR_OFFSET                   (0x20)         /**< (TC_SR) Status Register (channel = 0) Offset */
  #define TC_IER_OFFSET                  (0x24)         /**< (TC_IER) Interrupt Enable Register (channel = 0) Offset */
  #define TC_IDR_OFFSET                  (0x28)         /**< (TC_IDR) Interrupt Disable Register (channel = 0) Offset */
  #define TC_IMR_OFFSET                  (0x2C)         /**< (TC_IMR) Interrupt Mask Register (channel = 0) Offset */
  #define TC_EMR_OFFSET                  (0x30)         /**< (TC_EMR) Extended Mode Register (channel = 0) Offset */
#define TC_BCR_OFFSET                  (0xC0)         /**< (TC_BCR) Block Control Register Offset */
#define TC_BMR_OFFSET                  (0xC4)         /**< (TC_BMR) Block Mode Register Offset */
#define TC_QIER_OFFSET                 (0xC8)         /**< (TC_QIER) QDEC Interrupt Enable Register Offset */
#define TC_QIDR_OFFSET                 (0xCC)         /**< (TC_QIDR) QDEC Interrupt Disable Register Offset */
#define TC_QIMR_OFFSET                 (0xD0)         /**< (TC_QIMR) QDEC Interrupt Mask Register Offset */
#define TC_QISR_OFFSET                 (0xD4)         /**< (TC_QISR) QDEC Interrupt Status Register Offset */
#define TC_FMR_OFFSET                  (0xD8)         /**< (TC_FMR) Fault Mode Register Offset */
#define TC_WPMR_OFFSET                 (0xE4)         /**< (TC_WPMR) Write Protection Mode Register Offset */

/** \brief TC_CHANNEL register API structure */
typedef struct
{
  __O   uint32_t                       TC_CCR;          /**< Offset: 0x00 ( /W  32) Channel Control Register (channel = 0) */
  __IO  uint32_t                       TC_CMR;          /**< Offset: 0x04 (R/W  32) Channel Mode Register (channel = 0) */
  __IO  uint32_t                       TC_SMMR;         /**< Offset: 0x08 (R/W  32) Stepper Motor Mode Register (channel = 0) */
  __I   uint32_t                       TC_RAB;          /**< Offset: 0x0c (R/   32) Register AB (channel = 0) */
  __I   uint32_t                       TC_CV;           /**< Offset: 0x10 (R/   32) Counter Value (channel = 0) */
  __IO  uint32_t                       TC_RA;           /**< Offset: 0x14 (R/W  32) Register A (channel = 0) */
  __IO  uint32_t                       TC_RB;           /**< Offset: 0x18 (R/W  32) Register B (channel = 0) */
  __IO  uint32_t                       TC_RC;           /**< Offset: 0x1c (R/W  32) Register C (channel = 0) */
  __I   uint32_t                       TC_SR;           /**< Offset: 0x20 (R/   32) Status Register (channel = 0) */
  __O   uint32_t                       TC_IER;          /**< Offset: 0x24 ( /W  32) Interrupt Enable Register (channel = 0) */
  __O   uint32_t                       TC_IDR;          /**< Offset: 0x28 ( /W  32) Interrupt Disable Register (channel = 0) */
  __I   uint32_t                       TC_IMR;          /**< Offset: 0x2c (R/   32) Interrupt Mask Register (channel = 0) */
  __IO  uint32_t                       TC_EMR;          /**< Offset: 0x30 (R/W  32) Extended Mode Register (channel = 0) */
  __I   uint8_t                        Reserved1[0x0C];
} tc_channel_registers_t;
#define TC_CHANNEL_NUMBER (3U)

/** \brief TC register API structure */
typedef struct
{
        tc_channel_registers_t         TC_CHANNEL[TC_CHANNEL_NUMBER]; /**< Offset: 0x00 Channel Control Register (channel = 0) */
  __O   uint32_t                       TC_BCR;          /**< Offset: 0xc0 ( /W  32) Block Control Register */
  __IO  uint32_t                       TC_BMR;          /**< Offset: 0xc4 (R/W  32) Block Mode Register */
  __O   uint32_t                       TC_QIER;         /**< Offset: 0xc8 ( /W  32) QDEC Interrupt Enable Register */
  __O   uint32_t                       TC_QIDR;         /**< Offset: 0xcc ( /W  32) QDEC Interrupt Disable Register */
  __I   uint32_t                       TC_QIMR;         /**< Offset: 0xd0 (R/   32) QDEC Interrupt Mask Register */
  __I   uint32_t                       TC_QISR;         /**< Offset: 0xd4 (R/   32) QDEC Interrupt Status Register */
  __IO  uint32_t                       TC_FMR;          /**< Offset: 0xd8 (R/W  32) Fault Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  uint32_t                       TC_WPMR;         /**< Offset: 0xe4 (R/W  32) Write Protection Mode Register */
} tc_registers_t;
/** @}  end of Timer Counter */

#endif /* SAME_SAME70_TC_MODULE_H */

